{"config": [{"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 33, 33, 1], "filters": 32, "kernel_regularizer": null, "dtype": "float32", "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_7", "dilation_rate": [1, 1], "kernel_size": [11, 11], "use_bias": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_8", "dilation_rate": [1, 1], "kernel_size": [1, 1], "use_bias": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 1, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_9", "dilation_rate": [1, 1], "kernel_size": [7, 7], "use_bias": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 32, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_10", "dilation_rate": [1, 1], "kernel_size": [11, 11], "use_bias": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_11", "dilation_rate": [1, 1], "kernel_size": [1, 1], "use_bias": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 1, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_12", "dilation_rate": [1, 1], "kernel_size": [7, 7], "use_bias": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}